Revit 2027 API
ParameterTypeId.RebarSystemHookTypeBackDirn1 Property
 "Interior Major Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookTypeBackDirn1 { get; }
Public Shared ReadOnly Property RebarSystemHookTypeBackDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookTypeBackDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookTypeBackDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace